v2206/tutorial_MRF_stirred_tank/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    top
    {
        type            symmetry;
    }
    vessel
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    impeller
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
